cargo.org
#+TITLE: Cargo Loom: DotCortex
#+DESCRIPTION: Rust cargo manifest
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Cargo manifest
Columns: CRATE, VERSION, FEATURES, BINS, SOURCE, GIT_URL, GIT_REF, TARGET
Leave VERSION empty when using git pins.
#+BEGIN_SRC text :tangle all/.cargo/manifest/crates.ssv
# CRATE VERSION FEATURES BINS SOURCE GIT_URL GIT_REF TARGET LANE
czkawka_cli  "" "" "" crates.io "" "" "" host
neovide      "" "" "" git       https://github.com/neovide/neovide          "" "" host
starship     "" "" "" crates.io "" "" "" host
tpfancontrol "" "" "" git       https://github.com/Arnavion/tpfancontrol-rs "" "" host

ripgrep   "" "" "" crates.io "" "" "" host
fd-find   "" "" "" crates.io "" "" "" host
bat       "" "" "" crates.io "" "" "" host
lsd       "" "" "" crates.io "" "" "" host
eza       "" "" "" crates.io "" "" "" host
du-dust   "" "" "" crates.io "" "" "" host
rexit     "" "" "" crates.io "" "" "" host
#+END_SRC

* Isolated Rust env for DotCortex
#+BEGIN_SRC bash :tangle all/.local/bin/dotcortex-rust-env :shebang "#!/usr/bin/env bash"
set -euo pipefail

# Canonical, host-wide Rust locations, not under ~/DotCortex and not under HelmCortex.
export RUSTUP_HOME="${RUSTUP_HOME:-$HOME/.rustup}"
export CARGO_HOME="${CARGO_HOME:-$HOME/.cargo}"
export PATH="$CARGO_HOME/bin:/usr/bin:/bin:$PATH"

# Only care whether *our* cargo exists, not Guix or apt.
if [ ! -x "$CARGO_HOME/bin/cargo" ]; then
  echo ">> Installing rustup into $RUSTUP_HOME and cargo into $CARGO_HOME"
  curl -fsSL https://sh.rustup.rs | \
    RUSTUP_HOME="$RUSTUP_HOME" CARGO_HOME="$CARGO_HOME" \
    sh -s -- -y --no-modify-path --default-toolchain stable
fi

# Ensure a default toolchain is ready in this env.
if ! "$CARGO_HOME/bin/rustup" show >/dev/null 2>&1; then
  RUSTUP_HOME="$RUSTUP_HOME" CARGO_HOME="$CARGO_HOME" \
    "$CARGO_HOME/bin/rustup" default stable
fi

exec "$@"
#+END_SRC

* Capture current cargo → manifest
# Reads cargo install --list, appends new crates to DotCortex manifest
#+BEGIN_SRC bash :tangle all/.local/bin/cargo-capture :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/cargo-capture
set -euo pipefail

MAN="$HOME/DotCortex/all/.cargo/manifest/crates.ssv"
RUN="$HOME/.local/bin/dotcortex-rust-env"

mkdir -p "$(dirname "$MAN")"
touch "$MAN"

tmp_existing="$(mktemp)"
tmp_have="$(mktemp)"
tmp_new="$(mktemp)"

# Existing crates already tracked in manifest
awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_existing"

# Crates currently installed by cargo
"$RUN" cargo install --list 2>/dev/null \
  | awk '/^[^[:space:]]+ v[0-9]+\.[0-9]+\.[0-9]+:/ { print $1 }' \
  | sort -u >"$tmp_have"

# new = have - existing
comm -13 "$tmp_existing" "$tmp_have" >"$tmp_new"

rm -f "$tmp_existing" "$tmp_have"

if [ ! -s "$tmp_new" ]; then
  rm -f "$tmp_new"
  echo "No new cargo crates to capture into $MAN"
  exit 0
fi

while read -r crate; do
  [ -n "$crate" ] || continue
  # Default: floating latest on crates.io. You can edit VERSION later to pin.
  printf '%s "" "" "" crates.io "" "" ""\n' "$crate" >>"$MAN"
done <"$tmp_new"

rm -f "$tmp_new"

echo "Updated $MAN"
#+END_SRC

* Plan diff
#+BEGIN_SRC bash :tangle all/.local/bin/cargo-diff :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/cargo-diff
set -euo pipefail

MAN="$HOME/DotCortex/all/.cargo/manifest/crates.ssv"
RUN="$HOME/.local/bin/dotcortex-rust-env"

tmp_want="$(mktemp)"
tmp_have="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_want"

"$RUN" cargo install --list 2>/dev/null \
  | awk '/^[^[:space:]]+ v[0-9]+\.[0-9]+\.[0-9]+:/ { print $1 }' \
  | sort -u >"$tmp_have"

echo "== cargo plan =="
echo "[to install]"
comm -23 "$tmp_want" "$tmp_have" | sed 's/^/  + /'

echo "[to uninstall]"
comm -13 "$tmp_want" "$tmp_have" | sed 's/^/  - /'

rm -f "$tmp_want" "$tmp_have"
#+END_SRC


* Apply manifest inside DotCortex env
#+BEGIN_SRC bash :tangle all/.local/bin/cargo-apply :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

MAN="$HOME/DotCortex/all/.cargo/manifest/crates.ssv"

# Default runner (your existing choice)
RUN="$HOME/.local/bin/dotcortex-rust-env"

# Host-link runner (Guix toolchain, host libs)
HOST_RUN="$HOME/.local/bin/cargo-wrap"

DEFAULT_LANE="${DEFAULT_LANE:-host}"

ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"

echo "== cargo apply =="

# Check for host libraries required by crates that link against C libs
_check_host_deps() {
  local missing=()
  local -A libs=([freetype2]=libfreetype-dev [fontconfig]=libfontconfig-dev)
  for pc in "${!libs[@]}"; do
    if ! pkg-config --exists "$pc" 2>/dev/null; then
      missing+=("${libs[$pc]}")
    fi
  done
  if (( ${#missing[@]} )); then
    echo "ERROR: missing host libraries: ${missing[*]}"
    echo "Install them:  sudo apt install ${missing[*]}"
    exit 1
  fi
}
_check_host_deps

_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s|%s|%s|%s|%s\n",
        dequote($1),dequote($2),dequote($3),dequote($4),
        dequote($5),dequote($6),dequote($7),dequote($8),dequote($9)
    }
  ' "$MAN"
}

while IFS='|' read -r crate version features bins source git_url git_ref target lane
do
  [[ -n "$crate" ]] || continue

  lane="${lane:-$DEFAULT_LANE}"

  args=(install "$crate")

  if [[ -n "$version" ]]; then
    args+=(--version "$version" --locked)
  fi

  [[ -n "$features" ]] && args+=(--features "$features")

  if [[ -n "$bins" ]]; then
    IFS=',' read -ra BB <<<"$bins"
    for b in "${BB[@]}"; do
      [[ -n "$b" ]] && args+=(--bin "$b")
    done
  fi

  [[ -n "$target" ]] && args+=(--target "$target")

  if [[ "${source:-crates.io}" = "git" && -n "${git_url:-}" ]]; then
    args+=(--git "$git_url")
    [[ -n "${git_ref:-}" ]] && args+=(--rev "$git_ref")
  fi

  if [[ "$lane" = "host" ]]; then
    "$HOST_RUN" "${args[@]}"
  else
    "$RUN" cargo "${args[@]}"
  fi
done < <(_emit_norm)

if [[ "$ENFORCE" = 1 && "$UNINSTALL" = 1 ]]; then
  echo "== uninstall extras =="

  want_tmp="$(mktemp)"
  have_tmp="$(mktemp)"

  awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$want_tmp"

  "$RUN" cargo install --list 2>/dev/null \
    | awk '/^[^[:space:]]+ v[0-9]+\.[0-9]+\.[0-9]+:/ { print $1 }' \
    | sort -u >"$have_tmp"

  comm -13 "$want_tmp" "$have_tmp" | while read -r extra; do
    [[ -n "$extra" ]] || continue
    "$RUN" cargo uninstall "$extra" || true
  done

  rm -f "$want_tmp" "$have_tmp"
fi

echo "Done."
#+END_SRC

* Health
#+BEGIN_SRC bash :tangle all/.local/bin/cargo-health :shebang "#!/usr/bin/env bash"
set -euo pipefail
"$HOME/.local/bin/dotcortex-rust-env" bash -lc '
echo "RUSTUP_HOME=$RUSTUP_HOME"
echo "CARGO_HOME=$CARGO_HOME"
command -v cargo; cargo --version
command -v rustc; rustc --version
'
#+END_SRC

* Makefile fragment for cargo
#+BEGIN_SRC makefile :tangle all/.mk/cargo.mk :padline no
# ~/DotCortex/all/.mk/cargo.mk
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: cargo-capture cargo-diff cargo-sync cargo-apply cargo-health

cargo-capture:
| @chmod +x $(HOME)/.local/bin/cargo-capture 2>/dev/null || true
| $(HOME)/.local/bin/cargo-capture

cargo-diff:
| @chmod +x $(HOME)/.local/bin/cargo-diff 2>/dev/null || true
| $(HOME)/.local/bin/cargo-diff

# Install anything new from the manifest, do not uninstall extras, do not rebuild existing.
cargo-sync:
| @chmod +x $(HOME)/.local/bin/cargo-apply 2>/dev/null || true
| ENFORCE=0 UNINSTALL=0 UPDATE=0 $(HOME)/.local/bin/cargo-apply

# Strict apply: install, upgrade, and uninstall extras.
cargo-apply:
| @chmod +x $(HOME)/.local/bin/cargo-apply 2>/dev/null || true
| ENFORCE=1 UNINSTALL=1 UPDATE=1 $(HOME)/.local/bin/cargo-apply

cargo-health:
| @chmod +x $(HOME)/.local/bin/cargo-health 2>/dev/null || true
| $(HOME)/.local/bin/cargo-health
#+END_SRC

** Dedicated wrapper: cargo-wrap
This is basically the host-wrap philosophy, but tuned for builds, not GUI apps. It runs in a near empty env, keeps Guix cargo and rustc reachable, and forces pkg-config to look only at host paths so OpenSSL comes from /usr, not Guix.
#+BEGIN_SRC bash :tangle linux/.local/bin/cargo-wrap :shebang "#!/usr/bin/env bash" :mkdirp yes
#!/usr/bin/env bash
# Guix Cargo, Host Link Wrapper
# Goal: keep Guix cargo/rustc, but force host pkg-config and prevent Guix libs from being selected.

set -euo pipefail

CARGO_BIN="${CARGO_BIN:-$(command -v cargo || true)}"
[[ -n "${CARGO_BIN:-}" && -x "$CARGO_BIN" ]] || { echo "cargo-wrap: cargo not found" >&2; exit 127; }

RUSTC_BIN="${RUSTC_BIN:-$(command -v rustc || true)}"

cargo_dir="$(cd "$(dirname "$CARGO_BIN")" && pwd -P)"
rustc_dir=""
if [[ -n "${RUSTC_BIN:-}" && -x "$RUSTC_BIN" ]]; then
  rustc_dir="$(cd "$(dirname "$RUSTC_BIN")" && pwd -P)"
fi

# Build a minimal PATH:
# - Guix toolchain dir(s) so cargo can find rustc
# - host /usr/bin,/bin for cc, ld, pkg-config, git, etc
clean_path="$cargo_dir"
if [[ -n "${rustc_dir:-}" && "$rustc_dir" != "$cargo_dir" ]]; then
  clean_path="$clean_path:$rustc_dir"
fi
clean_path="$clean_path:/usr/bin:/bin"

# Host pkg-config search roots (Debian family)
triplet=""
if command -v dpkg-architecture >/dev/null 2>&1; then
  triplet="$(dpkg-architecture -qDEB_HOST_MULTIARCH 2>/dev/null || true)"
fi

pc=""
for d in \
  "/usr/lib/${triplet}/pkgconfig" \
  "/usr/lib/pkgconfig" \
  "/usr/share/pkgconfig"
do
  [[ -d "$d" ]] && pc="${pc:+$pc:}$d"
done
pc="${pc:-/usr/lib/pkgconfig:/usr/share/pkgconfig}"

LANG="${LANG:-C.UTF-8}"
LC_ALL="${LC_ALL:-}"
TERM="${TERM:-xterm-256color}"

# Preserve cargo homes if you have them set, else default
CARGO_HOME="${CARGO_HOME:-$HOME/.cargo}"
RUSTUP_HOME="${RUSTUP_HOME:-$HOME/.rustup}"

# Host openssl libdir (multiarch aware)
openssl_lib=""
if [[ -n "${triplet:-}" && -d "/usr/lib/${triplet}" ]]; then
  openssl_lib="/usr/lib/${triplet}"
elif [[ -d "/usr/lib64" ]]; then
  openssl_lib="/usr/lib64"
else
  openssl_lib="/usr/lib"
fi

exec env -i \
  HOME="$HOME" \
  PATH="$clean_path" \
  LANG="$LANG" \
  LC_ALL="$LC_ALL" \
  TERM="$TERM" \
  CARGO_HOME="$CARGO_HOME" \
  RUSTUP_HOME="$RUSTUP_HOME" \
  PKG_CONFIG_LIBDIR="$pc" \
  PKG_CONFIG_PATH="" \
  PKG_CONFIG_SYSROOT_DIR="" \
  OPENSSL_DIR="/usr" \
  OPENSSL_INCLUDE_DIR="/usr/include" \
  OPENSSL_LIB_DIR="$openssl_lib" \
  OPENSSL_NO_VENDOR="1" \
  "$CARGO_BIN" "$@"
#+END_SRC
