all/.local/bin/cargo-apply
#!/usr/bin/env bash
# Apply manifest inside DotCortex env

# [[file:../../../cargo.org::*Apply manifest inside DotCortex env][Apply manifest inside DotCortex env:1]]
#!/usr/bin/env bash
set -euo pipefail

MAN="$HOME/DotCortex/all/.cargo/manifest/crates.ssv"

# Default runner (your existing choice)
RUN="$HOME/.local/bin/dotcortex-rust-env"

# Host-link runner (Guix toolchain, host libs)
HOST_RUN="$HOME/.local/bin/cargo-wrap"

DEFAULT_LANE="${DEFAULT_LANE:-host}"

ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"

echo "== cargo apply =="

# Check for host libraries required by crates that link against C libs
_check_host_deps() {
  local missing=()
  local -A libs=([freetype2]=libfreetype-dev [fontconfig]=libfontconfig-dev)
  for pc in "${!libs[@]}"; do
    if ! pkg-config --exists "$pc" 2>/dev/null; then
      missing+=("${libs[$pc]}")
    fi
  done
  if (( ${#missing[@]} )); then
    echo "ERROR: missing host libraries: ${missing[*]}"
    echo "Install them:  sudo apt install ${missing[*]}"
    exit 1
  fi
}
_check_host_deps

_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s|%s|%s|%s|%s\n",
        dequote($1),dequote($2),dequote($3),dequote($4),
        dequote($5),dequote($6),dequote($7),dequote($8),dequote($9)
    }
  ' "$MAN"
}

while IFS='|' read -r crate version features bins source git_url git_ref target lane
do
  [[ -n "$crate" ]] || continue

  lane="${lane:-$DEFAULT_LANE}"

  args=(install "$crate")

  if [[ -n "$version" ]]; then
    args+=(--version "$version" --locked)
  fi

  [[ -n "$features" ]] && args+=(--features "$features")

  if [[ -n "$bins" ]]; then
    IFS=',' read -ra BB <<<"$bins"
    for b in "${BB[@]}"; do
      [[ -n "$b" ]] && args+=(--bin "$b")
    done
  fi

  [[ -n "$target" ]] && args+=(--target "$target")

  if [[ "${source:-crates.io}" = "git" && -n "${git_url:-}" ]]; then
    args+=(--git "$git_url")
    [[ -n "${git_ref:-}" ]] && args+=(--rev "$git_ref")
  fi

  if [[ "$lane" = "host" ]]; then
    "$HOST_RUN" "${args[@]}"
  else
    "$RUN" cargo "${args[@]}"
  fi
done < <(_emit_norm)

if [[ "$ENFORCE" = 1 && "$UNINSTALL" = 1 ]]; then
  echo "== uninstall extras =="

  want_tmp="$(mktemp)"
  have_tmp="$(mktemp)"

  awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$want_tmp"

  "$RUN" cargo install --list 2>/dev/null \
    | awk '/^[^[:space:]]+ v[0-9]+\.[0-9]+\.[0-9]+:/ { print $1 }' \
    | sort -u >"$have_tmp"

  comm -13 "$want_tmp" "$have_tmp" | while read -r extra; do
    [[ -n "$extra" ]] || continue
    "$RUN" cargo uninstall "$extra" || true
  done

  rm -f "$want_tmp" "$have_tmp"
fi

echo "Done."
# Apply manifest inside DotCortex env:1 ends here
