all/.local/bin/cargo-capture
#!/usr/bin/env bash
# Capture current cargo → manifest
# # Reads cargo install --list, appends new crates to DotCortex manifest

# [[file:../../../cargo.org::*Capture current cargo → manifest][Capture current cargo → manifest:1]]
# ~/DotCortex/all/.local/bin/cargo-capture
set -euo pipefail

MAN="$HOME/DotCortex/all/.cargo/manifest/crates.ssv"
RUN="$HOME/.local/bin/dotcortex-rust-env"

mkdir -p "$(dirname "$MAN")"
touch "$MAN"

tmp_existing="$(mktemp)"
tmp_have="$(mktemp)"
tmp_new="$(mktemp)"

# Existing crates already tracked in manifest
awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_existing"

# Crates currently installed by cargo
"$RUN" cargo install --list 2>/dev/null \
  | awk '/^[^[:space:]]+ v[0-9]+\.[0-9]+\.[0-9]+:/ { print $1 }' \
  | sort -u >"$tmp_have"

# new = have - existing
comm -13 "$tmp_existing" "$tmp_have" >"$tmp_new"

rm -f "$tmp_existing" "$tmp_have"

if [ ! -s "$tmp_new" ]; then
  rm -f "$tmp_new"
  echo "No new cargo crates to capture into $MAN"
  exit 0
fi

while read -r crate; do
  [ -n "$crate" ] || continue
  # Default: floating latest on crates.io. You can edit VERSION later to pin.
  printf '%s "" "" "" crates.io "" "" ""\n' "$crate" >>"$MAN"
done <"$tmp_new"

rm -f "$tmp_new"

echo "Updated $MAN"
# Capture current cargo → manifest:1 ends here
