linux/.local/bin/cargo-wrap
#!/usr/bin/env bash
# Dedicated wrapper: cargo-wrap
# This is basically the host-wrap philosophy, but tuned for builds, not GUI apps. It runs in a near empty env, keeps Guix cargo and rustc reachable, and forces pkg-config to look only at host paths so OpenSSL comes from /usr, not Guix.

# [[file:../../../cargo.org::*Dedicated wrapper: cargo-wrap][Dedicated wrapper: cargo-wrap:1]]
#!/usr/bin/env bash
# Guix Cargo, Host Link Wrapper
# Goal: keep Guix cargo/rustc, but force host pkg-config and prevent Guix libs from being selected.

set -euo pipefail

CARGO_BIN="${CARGO_BIN:-$(command -v cargo || true)}"
[[ -n "${CARGO_BIN:-}" && -x "$CARGO_BIN" ]] || { echo "cargo-wrap: cargo not found" >&2; exit 127; }

RUSTC_BIN="${RUSTC_BIN:-$(command -v rustc || true)}"

cargo_dir="$(cd "$(dirname "$CARGO_BIN")" && pwd -P)"
rustc_dir=""
if [[ -n "${RUSTC_BIN:-}" && -x "$RUSTC_BIN" ]]; then
  rustc_dir="$(cd "$(dirname "$RUSTC_BIN")" && pwd -P)"
fi

# Build a minimal PATH:
# - Guix toolchain dir(s) so cargo can find rustc
# - host /usr/bin,/bin for cc, ld, pkg-config, git, etc
clean_path="$cargo_dir"
if [[ -n "${rustc_dir:-}" && "$rustc_dir" != "$cargo_dir" ]]; then
  clean_path="$clean_path:$rustc_dir"
fi
clean_path="$clean_path:/usr/bin:/bin"

# Host pkg-config search roots (Debian family)
triplet=""
if command -v dpkg-architecture >/dev/null 2>&1; then
  triplet="$(dpkg-architecture -qDEB_HOST_MULTIARCH 2>/dev/null || true)"
fi

pc=""
for d in \
  "/usr/lib/${triplet}/pkgconfig" \
  "/usr/lib/pkgconfig" \
  "/usr/share/pkgconfig"
do
  [[ -d "$d" ]] && pc="${pc:+$pc:}$d"
done
pc="${pc:-/usr/lib/pkgconfig:/usr/share/pkgconfig}"

LANG="${LANG:-C.UTF-8}"
LC_ALL="${LC_ALL:-}"
TERM="${TERM:-xterm-256color}"

# Preserve cargo homes if you have them set, else default
CARGO_HOME="${CARGO_HOME:-$HOME/.cargo}"
RUSTUP_HOME="${RUSTUP_HOME:-$HOME/.rustup}"

# Host openssl libdir (multiarch aware)
openssl_lib=""
if [[ -n "${triplet:-}" && -d "/usr/lib/${triplet}" ]]; then
  openssl_lib="/usr/lib/${triplet}"
elif [[ -d "/usr/lib64" ]]; then
  openssl_lib="/usr/lib64"
else
  openssl_lib="/usr/lib"
fi

exec env -i \
  HOME="$HOME" \
  PATH="$clean_path" \
  LANG="$LANG" \
  LC_ALL="$LC_ALL" \
  TERM="$TERM" \
  CARGO_HOME="$CARGO_HOME" \
  RUSTUP_HOME="$RUSTUP_HOME" \
  PKG_CONFIG_LIBDIR="$pc" \
  PKG_CONFIG_PATH="" \
  PKG_CONFIG_SYSROOT_DIR="" \
  OPENSSL_DIR="/usr" \
  OPENSSL_INCLUDE_DIR="/usr/include" \
  OPENSSL_LIB_DIR="$openssl_lib" \
  OPENSSL_NO_VENDOR="1" \
  "$CARGO_BIN" "$@"
# Dedicated wrapper: cargo-wrap:1 ends here
